[
    {
        "subject": "Дискретная математика",
        "tickets": [
            {
                "text": "Деление математики на классическую и дискретную. История дискретной математики. Упрощение логических функций с помощью законов алгебры логики",
                "id": 1
            },
            {
                "text": "Понятие множеств. Язык теории множеств. Метод минимизации логических функции с помощью карт Карно или диаграмм Вейча",
                "id": 2
            },
            {
                "text": "Изображение множеств. Подмножества, универсальные множества, мощность множества. Свойства сложения по модулю два (М2 или строгой дизъюнкции)",
                "id": 3
            },
            {
                "text": "Способы задания множеств. Многочлен Жегалкина, порядок его построения",
                "id": 4
            },
            {
                "text": "Операции над множествами: объединение множеств, пересечение множеств, разность множеств",
                "id": 5
            },
            {
                "text": "Универсальные множества. Дополнение множества. Разбиения множества. Диаграммы Эйлера-Венна",
                "id": 6
            },
            {
                "text": "Определение графов и основные понятия (вершины, ребра, степень вершины, виды вершин). Упрощение логических функций с помощью законов алгебры логики",
                "id": 7
            },
            {
                "text": "Кортеж. Прямое произведение множеств.  Декартово произведение множеств. Теорема о полноте системы логических: функций. Критерий Поста-Яблонского",
                "id": 8
            },
            {
                "text": "Определение соответствий. Обратное соответствие. Композиция соответствий. Эйлеровы и Гамильтоновы графы",
                "id": 9
            },
            {
                "text": "Виды графов (полный, ориентированный, связный, с висячими вершинами, изоморфный, циклический, нуль-граф). Метод математической индукции",
                "id": 10
            },
            {
                "text": "Логические конечные автоматы с памятью",
                "id": 11
            },
            {
                "text": "Логические конечные автоматы без памяти. Деревья. Лес. Разрезы",
                "id": 12
            },
            {
                "text": "Построение совершенной нормальной формы логической функции по таблице истинности или ее нормальной форме. Правильный автомат (автомат Мура). Упрощённый вид диаграммы для правильных автоматов",
                "id": 13
            }
        ]
    },
    {
        "subject": "Теория вероятностей",
        "tickets": [
            {
                "text": "Сформулировать аксиомы теории вероятности. Сформулировать и доказать основные свойства вероятности. ",
                "id": 1
            },
            {
                "text": "Вывести формулу полной вероятности и формулу Байеса.",
                "id": 2
            },
            {
                "text": "Дать определение условной вероятности. Доказать теорему умножения для n событий. Дать определение независимых событий.",
                "id": 3
            },
            {
                "text": "Изложить схему Бернулли, вывести формулу о вероятности успехов в схеме Бернулли и следствия из нее.",
                "id": 4
            },
            {
                "text": "Дать определение функции распределения вероятностей случайной величины. Сформулировать и доказать ее свойства.",
                "id": 5
            },
            {
                "text": "Дать определение плотности распределения вероятностей случайной величины. Сформулировать и доказать ее свойства.",
                "id": 6
            },
            {
                "text": "Дать определение математического ожидания случайной величины, сформулировать и доказать его свойства. ",
                "id": 7
            },
            {
                "text": "Дать определение дисперсии, сформулировать и доказать ее свойства.",
                "id": 8
            },
            {
                "text": "Дать определение функции распределения вероятностей случайного вектора. Сформулировать и доказать ее свойства.",
                "id": 9
            },
            {
                "text": "Дать определение плотности двумерного случайного вектора, сформулировать и доказать ее свойства.",
                "id": 10
            },
            {
                "text": "Сформулировать и доказать теорему о свертке.",
                "id": 11
            },
            {
                "text": "Сформулировать и доказать теорему о свойствах ковариации. ",
                "id": 12
            },
            {
                "text": "Дать определение ковариационной матрицы случайного вектора. Сформулировать и доказать свойства коэффициента корреляции.",
                "id": 13
            }
        ]
    },
    {
        "subject": "Алгоритмы и структуры данных",
        "tickets": [
            {
                "text": "Основные структуры данных. Множества. Массивы. Записи.",
                "id": 1
            },
            {
                "text": "Алгоритмы поиска. Линейный поиск",
                "id": 2
            },
            {
                "text": "Поиск делением пополам (двоичный поиск).",
                "id": 3
            },
            {
                "text": "Прямой поиск строки.",
                "id": 4
            },
            {
                "text": "Алгоритм Кнута, Мориса и Пратта.",
                "id": 5
            },
            {
                "text": "Алгоритм Боуера и Мура.",
                "id": 6
            },
            {
                "text": "Сортировка. Основные понятия.",
                "id": 7
            },
            {
                "text": "Внутренняя сортировка и ее виды.",
                "id": 8
            },
            {
                "text": "Обменная сортировка.",
                "id": 9
            },
            {
                "text": "Сортировка методом «пузырька».",
                "id": 10
            },
            {
                "text": "Сортировка выбором. Принципы.",
                "id": 11
            },
            {
                "text": "Сортировка вставками.",
                "id": 12
            },
            {
                "text": "Сортировка Шелла.",
                "id": 13
            }
        ]
    },
    {
        "subject": "Язык программирования Java",
        "tickets": [
            {
                "text": "Обобщённые и параметризованные типы. Создание параметризованных классов.",
                "id": 1
            },
            {
                "text": "Работа с параметризованными методами. Ограничение типа сверху или снизу.",
                "id": 2
            },
            {
                "text": "Класс Number. Классы-оболочки. Автоупаковка и автораспаковка.",
                "id": 3
            },
            {
                "text": "Коллекции. Виды коллекций. Интерфейсы Set, List, Queue и их особенности.",
                "id": 4
            },
            {
                "text": "Обход элементов коллекции. Интерфейсы Iterable, Iterator и ListIterator",
                "id": 5
            },
            {
                "text": "Сортировка элементов коллекций. Интерфейсы Comparable и Comparator.",
                "id": 6
            },
            {
                "text": "Интерфейсы Set и SortedSet, их реализации. Классы HashSet и TreeSet.",
                "id": 7
            },
            {
                "text": "Интерфейс List и его реализации. Классы ArrayList и LinkedList.",
                "id": 8
            },
            {
                "text": "Интерфейсы Map и SortedMap, их реализации. Классы HashMap и TreeMap.",
                "id": 9
            },
            {
                "text": "Интерфейсы Queue и Deque. Классы PriorityQueue и ArrayDeque.",
                "id": 10
            },
            {
                "text": "Классы Collections и Arrays, методы для работы с коллекциями и массивами.",
                "id": 11
            },
            {
                "text": "Байтовые потоки ввода—вывода. Классы InputStream, OutputStream и их потомки.",
                "id": 12
            },
            {
                "text": "Символьные потоки ввода—вывода. Классы Reader, Writer и их потомки.",
                "id": 13
            }
        ]
    },
    {
        "subject": "Машинное обучение",
        "tickets": [
            {
                "text": "Задача классификации. Алгоритм KNN.",
                "id": 1
            },
            {
                "text": "Задача классификации. Алгоритм SVM.",
                "id": 2
            },
            {
                "text": "Обучение с учителем. Обучение без учителя. Основной принцип. Алгоритмы. ",
                "id": 3
            },
            {
                "text": "Методы кластерного анализа.",
                "id": 4
            },
            {
                "text": "Дерево принятия решений в задачах классификации и регрессии.",
                "id": 5
            },
            {
                "text": "Задача кластеризации. Алгоритм Kmeans.",
                "id": 6
            },
            {
                "text": "Задача кластеризации. Алгоритм DBSCAN.",
                "id": 7
            },
            {
                "text": "Метрики в задачах машинного обучения (и нейронных сетей). ",
                "id": 8
            },
            {
                "text": "Переобучение и недообучение. Что это? Когда и где возникает? Проблемы.",
                "id": 9
            },
            {
                "text": "Аугментация данных. Предобработка данных. ",
                "id": 10
            },
            {
                "text": "Ансамбли моделей машинного обучения. Бэггинг.",
                "id": 11
            },
            {
                "text": "Ансамбли моделей машинного обучения. Случайный лес.",
                "id": 12
            },
            {
                "text": "Ансамбли моделей машинного обучения. Бустинг.",
                "id": 13
            }
        ]
    }
]