thanks_text = ['Не благодарите', 'Всегда рады помочь', 'Не за что', 'Пожалуйста', 'Обращайтесь']
send_notes_text = ['У меня есть конспект по такой теме.', 'Высылаю Вам конспект.']

do_you_agree = ['Вы согласны с данным утверждением?', 'Верно ли данное утверждение?']
correct_answer_text = ['Великолепно', 'Потрясающе', 'Отлично', 'Правильно', 'Именно так']
next_question = ['Уже готовлю следующий вопрос', 'Не останавливаемся', 'Идем дальше', 'У меня есть еще вопрос', 'Переходим к следующему высказыванию']
wrong_answer_text = ['К сожалению, это неправильный ответ', 'Это не так', 'Ошибочка вышла', 'Очень жаль, но Вы не правы']
skip_question = ['Но ничего страшного', 'Не расстраивайтесь', 'В следующий раз Вы не ошибетесь']
less_than_half = "Но «важно не то, сколько раз ты упал, а сколько раз ты поднялся». "
greater_than_half = "Прекрасный результат! Но нет предела совершенству. "
all_right = "А вы знаток! Поздравляем с отличным результатом!"